## Target env: terraform/env
#### Terraform Init `success`
#### Terraform Validate `success`
#### Terraform Apply `failure`

<details><summary>Show Apply</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.eks.data.aws_eks_cluster_auth.cluster_auth: Reading...
data.aws_caller_identity.current: Reading...
module.eks.data.aws_iam_policy_document.assume_role: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.data.aws_region.current: Reading...
module.eks.data.aws_eks_cluster_auth.cluster_auth: Read complete after 0s [id=ipro-2023-eks-cluster]
module.eks.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.eks.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=189502314]
data.aws_caller_identity.current: Read complete after 0s [id=686355260515]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=686355260515]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_eks_fargate_profile.app_eks_node will be created
  + resource "aws_eks_fargate_profile" "app_eks_node" {
      + arn                    = (known after apply)
      + cluster_name           = "ipro-2023-eks-cluster"
      + fargate_profile_name   = "ipro-2023-app-fargate-profile"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = (known after apply)

      + selector {
          + namespace = "app"
        }
    }

  # aws_eks_fargate_profile.kube-system_eks_node will be created
  + resource "aws_eks_fargate_profile" "kube-system_eks_node" {
      + arn                    = (known after apply)
      + cluster_name           = "ipro-2023-eks-cluster"
      + fargate_profile_name   = "ipro-2023-kube-system-fargate-profile"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags_all               = (known after apply)

      + selector {
          + namespace = "kube-system"
        }
    }

  # kubernetes_config_map.aws_auth will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapRoles" = <<-EOT
                - rolearn = "arn:aws:iam::686355260515:role/*"
                  username: system:node:{{EC2PrivateDNSName}}
                  groups:
                    - system:bootstrappers
                    - system:nodes
            EOT
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cluster_encription_key.aws_kms_key.key will be created
  + resource "aws_kms_key" "key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = (known after apply)
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

  # module.cluster_encription_key.aws_kms_key_policy.key_policy will be created
  + resource "aws_kms_key_policy" "key_policy" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + policy                             = "\"{\\n    Statement = [\\n      {\\n        Action = \\\"kms:*\\\"\\n        Effect = \\\"Allow\\\"\\n        Principal = {\\n          \\\"AWS\\\" = arn:aws:sts::686355260515:assumed-role/AllowAccessFromIpro2023/GitHubActions\\\"\\n          }\\n\\n        Resource = \\\"*\\\"\\n        Sid      = \\\"EKS Cluster Encription Key\\\"\\n      },\\n    ]\\n    Version = \\\"2012-10-17\\\"\\n}\\n\""
    }

  # module.eks.data.aws_iam_policy_document.assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-node",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.eks.data.aws_iam_policy_document.pod_execution_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "pod_execution_role" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]

          + condition {
              + test     = "ArnLike"
              + values   = [
                  + "arn:aws:eks:ap-northeast-1:686355260515:fargateprofile/ipro-2023-eks-cluster/*",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "eks-fargate-pods.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.eks.data.tls_certificate.cluster will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "cluster" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_eks_cluster.cluster will be created
  + resource "aws_eks_cluster" "cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "ipro-2023-eks-cluster"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = "1.25"

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.cluster will be created
  + resource "aws_iam_openid_connect_provider" "cluster" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.aws_iam_role.cluster will be created
  + resource "aws_iam_role" "cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ipro-2023-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.oidc will be created
  + resource "aws_iam_role" "oidc" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-odic-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role.pod_execution_role will be created
  + resource "aws_iam_role" "pod_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ipro-2023-pod-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "ipro-2023-role"
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEKSVPCResourceController will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "ipro-2023-role"
    }

  # module.eks.aws_iam_role_policy_attachment.pod_execution_role will be created
  + resource "aws_iam_role_policy_attachment" "pod_execution_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      + role       = "ipro-2023-pod-execution-role"
    }

  # module.eks.aws_iam_role_policy_attachment.pod_execution_role_ecr will be created
  + resource "aws_iam_role_policy_attachment" "pod_execution_role_ecr" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "ipro-2023-pod-execution-role"
    }

  # module.eks.aws_security_group.cluster_shared will be created
  + resource "aws_security_group" "cluster_shared" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ipro-2023-cluster-shared"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ipro-2023-cluster-shared"
        }
      + tags_all               = {
          + "Name" = "ipro-2023-cluster-shared"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group.control_plane will be created
  + resource "aws_security_group" "control_plane" {
      + arn                    = (known after apply)
      + description            = "ipro-2023-eks-control-plane"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ipro-2023-eks-control-plane"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

  # module.eks.aws_security_group_rule.default_cluster_to_node will be created
  + resource "aws_security_group_rule" "default_cluster_to_node" {
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.inter_node will be created
  + resource "aws_security_group_rule" "inter_node" {
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.node_to_default_cluster will be created
  + resource "aws_security_group_rule" "node_to_default_cluster" {
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name" = "ipro-2023-vpc-default"
        }
      + tags_all               = {
          + "Name" = "ipro-2023-vpc-default"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "ipro-2023-vpc-default"
        }
      + tags_all               = {
          + "Name" = "ipro-2023-vpc-default"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ipro-2023-vpc-default"
        }
      + tags_all               = {
          + "Name" = "ipro-2023-vpc-default"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "ipro-2023-vpc-ap-northeast-1a"
        }
      + tags_all             = {
          + "Name" = "ipro-2023-vpc-ap-northeast-1a"
        }
      + vpc                  = true
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "ipro-2023-vpc"
        }
      + tags_all = {
          + "Name" = "ipro-2023-vpc"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "ipro-2023-vpc-ap-northeast-1a"
        }
      + tags_all             = {
          + "Name" = "ipro-2023-vpc-ap-northeast-1a"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "ipro-2023-vpc-private"
        }
      + tags_all         = {
          + "Name" = "ipro-2023-vpc-private"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "ipro-2023-vpc-public"
        }
      + tags_all         = {
          + "Name" = "ipro-2023-vpc-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "ipro-2023-vpc-private-ap-northeast-1a"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Name"                            = "ipro-2023-vpc-private-ap-northeast-1a"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "ipro-2023-vpc-private-ap-northeast-1c"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Name"                            = "ipro-2023-vpc-private-ap-northeast-1c"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "ipro-2023-vpc-private-ap-northeast-1d"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Name"                            = "ipro-2023-vpc-private-ap-northeast-1d"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "ipro-2023-vpc-public-ap-northeast-1a"
          + "kubernetes.io/role/elb" = "1"
        }
      + tags_all                                       = {
          + "Name"                   = "ipro-2023-vpc-public-ap-northeast-1a"
          + "kubernetes.io/role/elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "ipro-2023-vpc-public-ap-northeast-1c"
          + "kubernetes.io/role/elb" = "1"
        }
      + tags_all                                       = {
          + "Name"                   = "ipro-2023-vpc-public-ap-northeast-1c"
          + "kubernetes.io/role/elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "ipro-2023-vpc-public-ap-northeast-1d"
          + "kubernetes.io/role/elb" = "1"
        }
      + tags_all                                       = {
          + "Name"                   = "ipro-2023-vpc-public-ap-northeast-1d"
          + "kubernetes.io/role/elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "ipro-2023-vpc"
        }
      + tags_all                             = {
          + "Name" = "ipro-2023-vpc"
        }
    }

  # module.vpc.aws_vpn_gateway.this[0] will be created
  + resource "aws_vpn_gateway" "this" {
      + amazon_side_asn = "64512"
      + arn             = (known after apply)
      + id              = (known after apply)
      + tags            = {
          + "Name" = "ipro-2023-vpc"
        }
      + tags_all        = {
          + "Name" = "ipro-2023-vpc"
        }
      + vpc_id          = (known after apply)
    }

Plan: 43 to add, 0 to change, 0 to destroy.
module.cluster_encription_key.aws_kms_key.key: Creating...
module.vpc.aws_eip.nat[0]: Creating...
module.eks.aws_iam_role.cluster: Creating...
module.vpc.aws_vpc.this[0]: Creating...
module.eks.aws_iam_role.cluster: Creation complete after 1s [id=ipro-2023-role]
module.eks.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Creating...
module.eks.aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Creating...
module.eks.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Creation complete after 0s [id=ipro-2023-role-20230708135227794400000001]
module.eks.aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Creation complete after 0s [id=ipro-2023-role-20230708135227798700000002]
module.cluster_encription_key.aws_kms_key.key: Creation complete after 2s [id=904d45ee-0266-42b4-924e-8d7af4a1de7b]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Creating...
module.vpc.aws_eip.nat[0]: Creation complete after 2s [id=eipalloc-0ddc9693e04058768]
module.vpc.aws_vpc.this[0]: Still creating... [10s elapsed]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [10s elapsed]
module.vpc.aws_vpc.this[0]: Creation complete after 14s [id=vpc-00d69a9c0eca22428]
module.vpc.aws_default_security_group.this[0]: Creating...
module.vpc.aws_internet_gateway.this[0]: Creating...
module.vpc.aws_default_route_table.default[0]: Creating...
module.vpc.aws_subnet.public[0]: Creating...
module.eks.aws_security_group.cluster_shared: Creating...
module.vpc.aws_default_network_acl.this[0]: Creating...
module.vpc.aws_subnet.public[1]: Creating...
module.vpc.aws_route_table.public[0]: Creating...
module.vpc.aws_subnet.private[2]: Creating...
module.vpc.aws_default_route_table.default[0]: Creation complete after 1s [id=rtb-0b1599fca838224b7]
module.eks.aws_security_group.control_plane: Creating...
module.vpc.aws_internet_gateway.this[0]: Creation complete after 2s [id=igw-0ad4b086a5c2925a1]
module.vpc.aws_subnet.private[1]: Creating...
module.vpc.aws_subnet.public[1]: Creation complete after 2s [id=subnet-0bfff3212e86623a6]
module.vpc.aws_route_table.private[0]: Creating...
module.vpc.aws_subnet.public[0]: Creation complete after 2s [id=subnet-0297f532d7a4d9091]
module.vpc.aws_vpn_gateway.this[0]: Creating...
module.vpc.aws_route_table.public[0]: Creation complete after 2s [id=rtb-01f14c6a5a5e599e6]
module.vpc.aws_subnet.private[0]: Creating...
module.vpc.aws_subnet.private[2]: Creation complete after 2s [id=subnet-006aaa6573cd74e3a]
module.vpc.aws_subnet.public[2]: Creating...
module.vpc.aws_subnet.private[1]: Creation complete after 1s [id=subnet-0469991642125f7a2]
module.vpc.aws_route.public_internet_gateway[0]: Creating...
module.vpc.aws_subnet.public[2]: Creation complete after 1s [id=subnet-0f1da7f2b33ebf68f]
module.vpc.aws_subnet.private[0]: Creation complete after 1s [id=subnet-0041366317ae89b9f]
module.vpc.aws_nat_gateway.this[0]: Creating...
module.vpc.aws_route_table_association.public[1]: Creating...
module.vpc.aws_route_table.private[0]: Creation complete after 1s [id=rtb-0f3eefd9a67cb3abb]
module.vpc.aws_route_table_association.public[2]: Creating...
module.vpc.aws_default_network_acl.this[0]: Creation complete after 3s [id=acl-076b5b28f56364016]
module.vpc.aws_route_table_association.public[0]: Creating...
module.vpc.aws_default_security_group.this[0]: Creation complete after 3s [id=sg-08c05836d2aaa2a76]
module.vpc.aws_route_table_association.private[0]: Creating...
module.vpc.aws_route_table_association.public[1]: Creation complete after 1s [id=rtbassoc-06d52363b63635f18]
module.vpc.aws_route_table_association.private[2]: Creating...
module.vpc.aws_route_table_association.public[2]: Creation complete after 1s [id=rtbassoc-00c764b5cb89ab25b]
module.vpc.aws_route_table_association.private[1]: Creating...
module.eks.aws_security_group.cluster_shared: Creation complete after 4s [id=sg-00fb11e31896c1a40]
module.eks.aws_security_group_rule.inter_node: Creating...
module.vpc.aws_route.public_internet_gateway[0]: Creation complete after 1s [id=r-rtb-01f14c6a5a5e599e61080289494]
module.vpc.aws_route_table_association.public[0]: Creation complete after 1s [id=rtbassoc-01dffe1ff940459e7]
module.eks.aws_security_group.control_plane: Creation complete after 3s [id=sg-0f6a9b28ff4e34a1f]
module.eks.aws_eks_cluster.cluster: Creating...
module.vpc.aws_route_table_association.private[0]: Creation complete after 1s [id=rtbassoc-05bca5ac24f97c862]
module.vpc.aws_route_table_association.private[1]: Creation complete after 0s [id=rtbassoc-0e0a67aba0e9f7dcc]
module.vpc.aws_route_table_association.private[2]: Creation complete after 0s [id=rtbassoc-034be660a67fd2ecd]
module.eks.aws_security_group_rule.inter_node: Creation complete after 1s [id=sgrule-2339350107]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [20s elapsed]
module.vpc.aws_vpn_gateway.this[0]: Still creating... [10s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [10s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [10s elapsed]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [30s elapsed]
module.vpc.aws_vpn_gateway.this[0]: Still creating... [20s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [20s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [20s elapsed]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [40s elapsed]
module.vpc.aws_vpn_gateway.this[0]: Still creating... [30s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [30s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [30s elapsed]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [50s elapsed]
module.vpc.aws_vpn_gateway.this[0]: Still creating... [40s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [40s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [40s elapsed]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [1m0s elapsed]
module.vpc.aws_vpn_gateway.this[0]: Still creating... [50s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [50s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [50s elapsed]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [1m10s elapsed]
module.vpc.aws_vpn_gateway.this[0]: Still creating... [1m0s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m0s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [1m0s elapsed]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [1m20s elapsed]
module.vpc.aws_vpn_gateway.this[0]: Still creating... [1m10s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m10s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [1m10s elapsed]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [1m30s elapsed]
module.vpc.aws_vpn_gateway.this[0]: Creation complete after 1m17s [id=vgw-013235eff887f201e]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m20s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [1m20s elapsed]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [1m40s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m30s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [1m30s elapsed]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Still creating... [1m50s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m40s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [1m40s elapsed]
module.vpc.aws_nat_gateway.this[0]: Creation complete after 1m47s [id=nat-0d8283827dd3509c3]
module.vpc.aws_route.private_nat_gateway[0]: Creating...
module.vpc.aws_route.private_nat_gateway[0]: Creation complete after 1s [id=r-rtb-0f3eefd9a67cb3abb1080289494]
module.eks.aws_eks_cluster.cluster: Still creating... [1m50s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [2m0s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [2m10s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [2m20s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [2m30s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [2m40s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [2m50s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [3m0s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [3m10s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [3m20s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [3m30s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [3m40s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [3m50s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [4m0s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [4m10s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [4m20s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [4m30s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [4m40s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [4m50s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [5m0s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [5m10s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [5m20s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [5m30s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [5m40s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [5m50s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [6m0s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [6m10s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [6m20s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [6m30s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [6m40s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [6m50s elapsed]
module.eks.aws_eks_cluster.cluster: Still creating... [7m0s elapsed]
module.eks.aws_eks_cluster.cluster: Creation complete after 7m8s [id=ipro-2023-eks-cluster]
module.eks.data.aws_iam_policy_document.pod_execution_role: Reading...
module.eks.aws_security_group_rule.default_cluster_to_node: Creating...
module.eks.aws_security_group_rule.node_to_default_cluster: Creating...
module.eks.data.tls_certificate.cluster: Reading...
module.eks.data.aws_iam_policy_document.pod_execution_role: Read complete after 0s [id=1722845150]
module.eks.aws_iam_role.pod_execution_role: Creating...
kubernetes_config_map.aws_auth: Creating...
module.eks.aws_iam_role.pod_execution_role: Creation complete after 0s [id=ipro-2023-pod-execution-role]
module.eks.aws_iam_role_policy_attachment.pod_execution_role_ecr: Creating...
module.eks.aws_iam_role_policy_attachment.pod_execution_role: Creating...
aws_eks_fargate_profile.kube-system_eks_node: Creating...
aws_eks_fargate_profile.app_eks_node: Creating...
module.eks.aws_iam_role_policy_attachment.pod_execution_role: Creation complete after 0s [id=ipro-2023-pod-execution-role-20230708135953730300000006]
module.eks.aws_iam_role_policy_attachment.pod_execution_role_ecr: Creation complete after 0s [id=ipro-2023-pod-execution-role-20230708135953777200000007]
module.eks.data.tls_certificate.cluster: Read complete after 1s [id=876ec6096b3f2e9d22b7016d735a7689929468a2]
module.eks.aws_iam_openid_connect_provider.cluster: Creating...
module.eks.aws_iam_openid_connect_provider.cluster: Creation complete after 0s [id=arn:aws:iam::686355260515:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/9E18A9EBE551842B15641BFBDEFB50EC]
module.eks.data.aws_iam_policy_document.assume_role_policy: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=256746824]
module.eks.aws_iam_role.oidc: Creating...
module.eks.aws_iam_role.oidc: Creation complete after 0s [id=eks-odic-role]
kubernetes_config_map.aws_auth: Creation complete after 1s [id=kube-system/aws-auth]
module.eks.aws_security_group_rule.default_cluster_to_node: Creation complete after 2s [id=sgrule-824233390]
module.eks.aws_security_group_rule.node_to_default_cluster: Creation complete after 2s [id=sgrule-2683651886]
aws_eks_fargate_profile.kube-system_eks_node: Still creating... [10s elapsed]
aws_eks_fargate_profile.app_eks_node: Still creating... [10s elapsed]
aws_eks_fargate_profile.kube-system_eks_node: Still creating... [20s elapsed]
aws_eks_fargate_profile.app_eks_node: Still creating... [20s elapsed]
aws_eks_fargate_profile.kube-system_eks_node: Still creating... [30s elapsed]
aws_eks_fargate_profile.app_eks_node: Still creating... [30s elapsed]
aws_eks_fargate_profile.kube-system_eks_node: Still creating... [40s elapsed]
aws_eks_fargate_profile.app_eks_node: Still creating... [40s elapsed]
aws_eks_fargate_profile.app_eks_node: Still creating... [50s elapsed]
Releasing state lock. This may take a few moments...
```

</details>